---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrResultsVisibility
source: html/1b58d735-f0b4-8f13-52a1-b25e1329cfe6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrResultsVisibility Property

"Results Visibility"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrResultsVisibility { get; }
```